app/views/comments/_comment.erb

INSERT INTO "comments" ("body", "rating", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "35"], ["rating", 2], ["product_id", 3], ["user_id", 1], ["created_at", "2016-03-11 00:30:23.445936"], ["updated_at", "2016-03-11 00:30:23.445936"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
            <p>
                <%= comment.user.first_name %> <small><em><%= "#{time_ago_in_words(comment.created_at)} ago" %></em></small>