app/controllers/comments_controller.rb

    def create
        @product = Product.find(params[:product_id])
        @comment = @product.comments.new(comment_params)
        @comment.user = current_user
        respond_to do |format|
          if @comment.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("body", "rating", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "This is a comment"], ["rating", 2], ["product_id", 3], ["user_id", 3], ["created_at", "2016-02-15 17:48:52.705721"], ["updated_at", "2016-02-15 17:48:52.705721"]]

    def destroy
      @comment = Comment.find(params[:id])
      product = @comment.product
      @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]