app/controllers/payments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "orders" ("product_id", "user_id", "total") VALUES (?, ?, ?)  [["product_id", 3], ["user_id", 3], ["total", 39999.0]]
---
    def create
        @product = Product.find(params[:product_id])
        @user = current_user
        token = params[:stripeToken]
        # Create the charge on Stripe's servers - this will charge the user's card
        begin
            charge = Stripe::Charge.create(
            :amount => @product.price.to_i,  # amount in cents, again
            :currency => "usd",
            :source => token,
            :description => params[:stripeEmail]
            )

            if charge.paid
                logger.debug "create order"
              Order.create(:product_id => @product.id, :user_id => @user.id, :total => @product.price)