app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%Roy%')
SELECT "products".* FROM "products"
---
  def index
     if params[:q]
    search_term = params[:q]
     @products = Product.where("name LIKE ?", "%#{search_term}%")
    else
     @products = Product.all

SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ?  ORDER BY created_at DESC  [["product_id", 3]]
SELECT  "comments".* FROM "comments" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "comments"
---
  def show
    @comments = @product.comments.order("created_at DESC")
    @comments = Comment.paginate(:page => params[:page])

INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["description", "test"], ["image_url", ""], ["created_at", "2015-12-27 23:46:21.400757"], ["updated_at", "2015-12-27 23:46:21.400757"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "Nexus 6 basic pleasure model. (Console generated product)"], ["updated_at", "2015-12-28 18:01:15.869473"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)